InformationRegisters/НастройкаВидовКонтактнойИнформацииКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаВидовКонтактнойИнформацииКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКонтактнойИнформацииФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКонтактнойИнформацииКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаВидовКонтактнойИнформацииКандидатов/Ext/RecordSetModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//@skip-check data-exchange-load
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ВидыКИФизическихЛиц = ВыгрузитьКолонку("ВидКонтактнойИнформацииФизическогоЛица");
	ПроверитьУникальностьНастроекДляВидовКИФизическихЛиц(ВидыКИФизическихЛиц, Отказ, Замещение);
	
	Если Не Отказ Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ВидыКИФизическихЛиц - Массив из СправочникСсылка.ВидыКонтактнойИнформации
//  Отказ - Булево
Процедура ПроверитьУникальностьНастроекДляВидовКИФизическихЛиц(ВидыКИФизическихЛиц, Отказ, Замещение)
	Если РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	Если ВидыКИФизическихЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкаВидовКонтактнойИнформацииКандидатов.ВидКонтактнойИнформацииФизическогоЛица КАК ВидКИФизическогоЛица,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкаВидовКонтактнойИнформацииКандидатов.ВидКонтактнойИнформацииКандидата) КАК
		|		ВидКИКандидата,
		|	МАКСИМУМ(НастройкаВидовКонтактнойИнформацииКандидатов.ВидКонтактнойИнформацииФизическогоЛица.Наименование) КАК
		|		ВидКИФизическогоЛицаПредставление
		|ИЗ
		|	РегистрСведений.НастройкаВидовКонтактнойИнформацииКандидатов КАК НастройкаВидовКонтактнойИнформацииКандидатов
		|ГДЕ
		|	НастройкаВидовКонтактнойИнформацииКандидатов.ВидКонтактнойИнформацииФизическогоЛица В (&ВидыКИФизическихЛиц)
		|СГРУППИРОВАТЬ ПО
		|	НастройкаВидовКонтактнойИнформацииКандидатов.ВидКонтактнойИнформацииФизическогоЛица
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НастройкаВидовКонтактнойИнформацииКандидатов.ВидКонтактнойИнформацииКандидата) > 1";
	
	Запрос.УстановитьПараметр("ВидыКИФизическихЛиц", ВидыКИФизическихЛиц);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПредставленияКИ = Новый Массив; // Массив из Строка
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//@skip-check invocation-parameter-type-intersect
		//@skip-check property-return-type
		ПредставленияКИ.Добавить(ВыборкаДетальныеЗаписи.ВидКИФизическогоЛицаПредставление);
	КонецЦикла;
	
	Если ПредставленияКИ.Количество() = 1 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Уже существует соответствие для вида контактной информации физического лица %1'"),
			ПредставленияКИ[0]);
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Уже существуют настройки для видов контактной информации физического лица %1'"),
			СтрСоединить(ПредставленияКИ, ","));
	КонецЕсли;
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
